In [1]:
%matplotlib inline
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
mydata = np.random.randn(4,3)

In [3]:
mydata

array([[ 0.42435052,  0.27356409, -0.10625304],
       [-0.44742434, -0.61665284,  0.16330559],
       [ 0.04813951, -0.2223141 , -0.28442695],
       [-0.98069543, -0.17465316, -0.65495753]])

In [4]:
df1 = pd.DataFrame(mydata, columns=list("ABC"))

In [5]:
df1

          A         B         C
0  0.424351  0.273564 -0.106253
1 -0.447424 -0.616653  0.163306
2  0.048140 -0.222314 -0.284427
3 -0.980695 -0.174653 -0.654958

In [6]:
df2 = pd.DataFrame(np.random.randn(3, 3), columns=list("ABC"))

In [7]:
df2

          A         B         C
0  0.219422  1.011259 -0.097469
1  0.246894 -0.407108  1.447511
2 -0.496932  1.409859 -1.227388

In [8]:
df3 = pd.concat([df1, df2], axis=0)

In [9]:
df3

          A         B         C
0  0.424351  0.273564 -0.106253
1 -0.447424 -0.616653  0.163306
2  0.048140 -0.222314 -0.284427
3 -0.980695 -0.174653 -0.654958
0  0.219422  1.011259 -0.097469
1  0.246894 -0.407108  1.447511
2 -0.496932  1.409859 -1.227388

In [10]:
df3.index = range(7)

In [11]:
df3

          A         B         C
0  0.424351  0.273564 -0.106253
1 -0.447424 -0.616653  0.163306
2  0.048140 -0.222314 -0.284427
3 -0.980695 -0.174653 -0.654958
4  0.219422  1.011259 -0.097469
5  0.246894 -0.407108  1.447511
6 -0.496932  1.409859 -1.227388

In [12]:
df4 = pd.concat([df1, df2], axis=1)

In [13]:
df4

          A         B         C         A         B         C
0  0.424351  0.273564 -0.106253  0.219422  1.011259 -0.097469
1 -0.447424 -0.616653  0.163306  0.246894 -0.407108  1.447511
2  0.048140 -0.222314 -0.284427 -0.496932  1.409859 -1.227388
3 -0.980695 -0.174653 -0.654958       NaN       NaN       NaN